tap "espanso/espanso"
tap "homebrew/bundle"
tap "homebrew/services"
tap "localstack/tap"
tap "xcodesorg/made"
brew "python@3.12"
brew "glib"
brew "libtiff"
brew "harfbuzz"
brew "pango"
brew "librsvg"
brew "adwaita-icon-theme"
brew "webp"
brew "jpeg-xl"
brew "aom"
brew "aria2"
brew "ascii"
brew "at-spi2-core"
brew "bash"
brew "clang-format"
brew "cmake"
brew "coreutils"
brew "cppcheck"
brew "diffutils"
brew "enchant"
brew "envoy"
brew "leptonica"
brew "tesseract"
brew "ghostscript"
brew "unbound"
brew "gnutls"
brew "gnupg"
brew "gpgme"
brew "gsettings-desktop-schemas"
brew "gspell"
brew "libspectre"
brew "poppler"
brew "evince"
brew "exiftool"
brew "eza"
brew "libass"
brew "librist"
brew "ffmpeg"
brew "findutils"
brew "fish"
brew "gawk"
brew "gd"
brew "git-lfs"
brew "gnu-sed"
brew "gnu-tar"
brew "lua"
brew "qt"
brew "gnuplot"
brew "go-task"
brew "grep"
brew "groonga"
brew "gzip"
brew "htop"
brew "libheif"
brew "libraw"
brew "imagemagick"
brew "libqalculate"
brew "libyaml"
brew "llvm"
brew "lolcat"
brew "mactop"
brew "mariadb"
brew "mas"
brew "moreutils"
brew "netcat"
brew "nkf"
brew "nmap"
brew "openssl@1.1"
brew "p7zip"
brew "pinentry-mac"
brew "pipx"
brew "postgresql@14"
brew "pqiv"
brew "protobuf"
brew "protobuf@3"
brew "pstree"
brew "pwgen"
brew "qrencode"
brew "qt@5"
brew "sevenzip"
brew "sheldon"
brew "silicon"
brew "sl"
brew "tailscale"
brew "telnet"
brew "tfenv"
brew "the_silver_searcher"
brew "tmux"
brew "translate-shell"
brew "tree"
brew "ttyd"
brew "typst"
brew "unzip"
brew "virtualenv"
brew "wget"
brew "yt-dlp"
brew "zbar"
brew "localstack/tap/localstack-cli"
brew "xcodesorg/made/xcodes"
cask "alacritty"
cask "amethyst"
cask "aquaskk"
cask "blackhole-2ch"
cask "brave-browser"
cask "discord"
cask "espanso"
cask "firefox"
cask "inkscape"
cask "iterm2"
cask "keycastr"
cask "microsoft-edge"
cask "ngrok"
cask "obs"
cask "obsidian"
cask "thunderbird"
cask "unnaturalscrollwheels"
cask "visual-studio-code"
cask "vlc"
cask "vnc-viewer"
cask "wezterm"
cask "whichspace"
cask "wireshark"
mas "Amphetamine", id: 937984704
mas "Bitwarden", id: 1352778147
mas "GarageBand", id: 682658836
mas "iMovie", id: 408981434
mas "iScreen Shoter", id: 1596559494
mas "Keynote", id: 409183694
mas "Kindle", id: 302584613
mas "LINE", id: 539883307
mas "Magnet", id: 441258766
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "RunCat", id: 1429033973
mas "Tailscale", id: 1475387142
mas "Xcode", id: 497799835
vscode "editorconfig.editorconfig"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "hashicorp.terraform"
vscode "ms-ceintl.vscode-language-pack-ja"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vsliveshare.vsliveshare"
vscode "redhat.vscode-yaml"
vscode "tamasfe.even-better-toml"
vscode "vscodevim.vim"
