tap "espanso/espanso"
tap "homebrew/bundle"
tap "homebrew/services"
brew "webp"
brew "jpeg-xl"
brew "aom"
brew "openssl@3"
brew "libssh2"
brew "aria2"
brew "ascii"
brew "bash"
brew "clang-format"
brew "cmake"
brew "coreutils"
brew "cppcheck"
brew "diffutils"
brew "envoy"
brew "gnupg"
brew "evince"
brew "exiftool"
brew "leptonica"
brew "tesseract"
brew "ffmpeg"
brew "findutils"
brew "fish"
brew "gawk"
brew "gd"
brew "git-lfs"
brew "gnu-sed"
brew "gnu-tar"
brew "lua"
brew "gnuplot"
brew "grep"
brew "gzip"
brew "htop"
brew "libheif"
brew "imagemagick"
brew "krb5"
brew "libgit2"
brew "libqalculate"
brew "libyaml"
brew "llvm"
brew "lolcat"
brew "mas"
brew "moreutils"
brew "netcat"
brew "nkf"
brew "nmap"
brew "openssl@1.1"
brew "p7zip"
brew "pinentry-mac"
brew "postgresql@14"
brew "pqiv"
brew "protobuf@3"
brew "pwgen"
brew "qt@5"
brew "sevenzip"
brew "the_silver_searcher"
brew "tmux"
brew "translate-shell"
brew "tree"
brew "ttyd"
brew "typst"
brew "unzip"
brew "virtualenv"
brew "wget"
cask "alacritty"
cask "amethyst"
cask "aquaskk"
cask "brave-browser"
cask "discord"
cask "espanso"
cask "firefox"
cask "inkscape"
cask "iterm2"
cask "karabiner-elements"
cask "microsoft-edge"
cask "ngrok"
cask "notion"
cask "obsidian"
cask "thunderbird"
cask "unnaturalscrollwheels"
cask "visual-studio-code"
cask "vlc"
cask "vnc-viewer"
cask "wezterm"
cask "whichspace"
cask "wireshark"
mas "Amphetamine", id: 937984704
mas "Curve", id: 1219074514
mas "Foxit PDF Reader", id: 1032155965
mas "Inkscape editor for graphics", id: 6443424132
mas "iScreen Shoter", id: 1596559494
mas "Key Codes", id: 414568915
mas "Kindle Classic", id: 405399194
mas "LINE", id: 539883307
mas "Microsoft Excel", id: 462058435
mas "Microsoft OneNote", id: 784801555
mas "Microsoft Outlook", id: 985367838
mas "Microsoft PowerPoint", id: 462062816
mas "Microsoft Word", id: 462054704
mas "MKPlayer", id: 1335612105
mas "OneDrive", id: 823766827
mas "PDF Reader Pro Lite", id: 919472673
mas "Prime Video", id: 545519333
mas "RunCat", id: 1429033973
mas "Slack", id: 803453959
mas "TapRecord", id: 1624223891
